Revit 2026 API

# BoundaryValidation Properties

---

The BoundaryValidation type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

BoundaryValidation Class

Autodesk.Revit.DB Namespace